{"format": "layers-model", "generatedBy": "keras v2.1.4", "convertedBy": "TensorFlow.js Converter v1.3.2", "modelTopology": {"keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"use_bias": true, "dtype": "float32", "batch_input_shape": [null, 8], "bias_regularizer": null, "activation": "relu", "units": 1000, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "name": "dense_1", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "activation": "relu", "units": 1000, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "name": "dense_2", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "activation": "relu", "units": 800, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "name": "dense_3", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "activation": "relu", "units": 500, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "name": "dense_4", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "activation": "relu", "units": 100, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "name": "dense_5", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "activation": "relu", "units": 8, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "name": "dense_6", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_regularizer": null, "activation": "linear", "units": 1, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "activity_regularizer": null, "name": "dense_7", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}, "training_config": {"metrics": [], "sample_weight_mode": null, "loss_weights": null, "loss": "mae", "optimizer_config": {"class_name": "Adam", "config": {"amsgrad": false, "decay": 0.0, "beta_1": 0.8999999761581421, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "epsilon": 1e-07}}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "dense_1/kernel", "shape": [8, 1000], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1000], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [1000, 1000], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [1000], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [1000, 800], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [800], "dtype": "float32"}, {"name": "dense_4/kernel", "shape": [800, 500], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [500], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [500, 100], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [100], "dtype": "float32"}, {"name": "dense_6/kernel", "shape": [100, 8], "dtype": "float32"}, {"name": "dense_6/bias", "shape": [8], "dtype": "float32"}, {"name": "dense_7/kernel", "shape": [8, 1], "dtype": "float32"}, {"name": "dense_7/bias", "shape": [1], "dtype": "float32"}]}]}