{"generatedBy": "keras v2.1.4", "format": "layers-model", "weightsManifest": [{"weights": [{"shape": [8, 1000], "name": "dense_1_1/kernel", "dtype": "float32"}, {"shape": [1000], "name": "dense_1_1/bias", "dtype": "float32"}, {"shape": [1000, 1000], "name": "dense_2_1/kernel", "dtype": "float32"}, {"shape": [1000], "name": "dense_2_1/bias", "dtype": "float32"}, {"shape": [1000, 800], "name": "dense_3_1/kernel", "dtype": "float32"}, {"shape": [800], "name": "dense_3_1/bias", "dtype": "float32"}, {"shape": [800, 500], "name": "dense_4_1/kernel", "dtype": "float32"}, {"shape": [500], "name": "dense_4_1/bias", "dtype": "float32"}, {"shape": [500, 100], "name": "dense_5_1/kernel", "dtype": "float32"}, {"shape": [100], "name": "dense_5_1/bias", "dtype": "float32"}, {"shape": [100, 8], "name": "dense_6_1/kernel", "dtype": "float32"}, {"shape": [8], "name": "dense_6_1/bias", "dtype": "float32"}, {"shape": [8, 1], "name": "dense_7_1/kernel", "dtype": "float32"}, {"shape": [1], "name": "dense_7_1/bias", "dtype": "float32"}], "paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"]}], "modelTopology": {"keras_version": "2.1.4", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 8], "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 1000, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "name": "dense_1", "bias_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 1000, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "name": "dense_2", "bias_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 800, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "name": "dense_3", "bias_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 500, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "name": "dense_4", "bias_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 100, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "name": "dense_5", "bias_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 8, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "name": "dense_6", "bias_constraint": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "units": 1, "use_bias": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "name": "dense_7", "bias_constraint": null, "activation": "linear"}}]}, "backend": "tensorflow", "training_config": {"loss": "mae", "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "lr": 0.0010000000474974513, "amsgrad": false, "decay": 0.0}}, "loss_weights": null, "sample_weight_mode": null, "metrics": []}}, "convertedBy": "TensorFlow.js Converter v1.2.10.1"}