{"generatedBy": "keras v2.1.4", "weightsManifest": [{"weights": [{"name": "dense_1_1/kernel", "dtype": "float32", "shape": [8, 1000]}, {"name": "dense_1_1/bias", "dtype": "float32", "shape": [1000]}, {"name": "dense_2_1/kernel", "dtype": "float32", "shape": [1000, 1000]}, {"name": "dense_2_1/bias", "dtype": "float32", "shape": [1000]}, {"name": "dense_3_1/kernel", "dtype": "float32", "shape": [1000, 800]}, {"name": "dense_3_1/bias", "dtype": "float32", "shape": [800]}, {"name": "dense_4_1/kernel", "dtype": "float32", "shape": [800, 500]}, {"name": "dense_4_1/bias", "dtype": "float32", "shape": [500]}, {"name": "dense_5_1/kernel", "dtype": "float32", "shape": [500, 100]}, {"name": "dense_5_1/bias", "dtype": "float32", "shape": [100]}, {"name": "dense_6_1/kernel", "dtype": "float32", "shape": [100, 8]}, {"name": "dense_6_1/bias", "dtype": "float32", "shape": [8]}, {"name": "dense_7_1/kernel", "dtype": "float32", "shape": [8, 1]}, {"name": "dense_7_1/bias", "dtype": "float32", "shape": [1]}], "paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"]}], "modelTopology": {"model_config": {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"units": 1000, "bias_constraint": null, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "activity_regularizer": null, "name": "dense_1", "batch_input_shape": [null, 8], "activation": "relu", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 1000, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "trainable": true, "name": "dense_2", "activation": "relu", "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 800, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "trainable": true, "name": "dense_3", "activation": "relu", "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 500, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "trainable": true, "name": "dense_4", "activation": "relu", "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 100, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "trainable": true, "name": "dense_5", "activation": "relu", "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 8, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "trainable": true, "name": "dense_6", "activation": "relu", "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 1, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "trainable": true, "name": "dense_7", "activation": "linear", "bias_regularizer": null, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null}}]}, "training_config": {"metrics": [], "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"epsilon": 1e-07, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "amsgrad": false, "decay": 0.0}}, "sample_weight_mode": null, "loss": "mae"}, "backend": "tensorflow", "keras_version": "2.1.4"}, "format": "layers-model", "convertedBy": "TensorFlow.js Converter v1.2.10.1"}